AguCami/llama-v2/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-LCD-1.83 (ESP32-S3R8: 8 MB PSRAM octal, 16 MB flash)

CONFIG_IDF_TARGET="esp32s3"

# --- flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM octal a 80 MHz ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- CPU al maximo: el rasterizador lo agradece ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- coma flotante rapida (el motor 3D usa float en el bucle interno) ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# --- USB CDC para los logs por el puerto tipo C ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- pila principal ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
